app/views/opinions/index.html.erb

<h2>Opinions</h2>
<% @place.opinions.each do |opinion| %>
---
SELECT "opinions".* FROM "opinions"  WHERE "opinions"."place_id" = ?  [["place_id", 1]]