app/controllers/opinions_controller.rb

  def index
    @opinions = Opinion.all
---
SELECT "opinions".* FROM "opinions"

  def show
    @place = Place.find(params[:place_id])
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @place = Place.find(params[:place_id])
    @opinion = @place.opinions.create(opinion_params)
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "opinions" ("comment", "created_at", "date", "mark", "place_id", "pseudo", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["comment", "qzdqzd"], ["created_at", "2015-05-19 14:19:13.676373"], ["date", "2015-05-19"], ["mark", 5], ["place_id", 1], ["pseudo", "qzdzd"], ["updated_at", "2015-05-19 14:19:13.676373"]]

  def update
    respond_to do |format|
      if @opinion.update(opinion_params)
---
UPDATE "opinions" SET "comment" = ?, "mark" = ?, "pseudo" = ?, "updated_at" = ? WHERE "opinions"."id" = 2  [["comment", "Sympas !"], ["mark", 8], ["pseudo", "Bastien"], ["updated_at", "2015-05-26 08:30:59.299788"]]

    def set_opinion
      @place = Place.find(params[:place_id])
      @opinion = Opinion.find(params[:id])
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "opinions".* FROM "opinions"  WHERE "opinions"."id" = ? LIMIT 1  [["id", 1]]