app/controllers/places_controller.rb

INSERT INTO "places" ("address", "created_at", "dateEnd", "dateStart", "description", "event", "latitude", "longitude", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @place = Place.new(place_params)

    respond_to do |format|
      if @place.save

UPDATE "places" SET "description" = ?, "updated_at" = ? WHERE "places"."id" = 4  [["description", "Repas devant Ingésup"], ["updated_at", "2015-05-26 08:30:02.763080"]]
---
  def update
    respond_to do |format|
      if @place.update(place_params)

DELETE FROM "places" WHERE "places"."id" = ?  [["id", 7]]
---
  def destroy
    @place.destroy