app/views/places/show.html.erb

SELECT "opinions".* FROM "opinions"  WHERE "opinions"."place_id" = ?  [["place_id", 1]]
---
<ul>
  <% @place.opinions.each do |opinion| %>